4_Integrado/Integrado_Bpel_Tienda_CA/src/jbiServiceUnits/Integrado_Bpel_Tienda/BpelIntegrado.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="BpelIntegrado" targetNamespace="http://j2ee.netbeans.org/wsdl/4_Bpel_Tienda/src/BpelIntegrado"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/4_Bpel_Tienda/src/BpelIntegrado" xmlns:ns="http://xml.netbeans.org/schema/BpelIntegrado" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/4_Bpel_Tienda/src/BpelIntegrado">
            <xsd:import namespace="http://xml.netbeans.org/schema/BpelIntegrado" schemaLocation="BpelIntegrado.xsd"/>
        </xsd:schema>
    </types>
    <message name="SolicitarPedidoOperationRequest">
        <part name="solicitudPedido" element="ns:eltoSolicitud"/>
    </message>
    <message name="SolicitarPedidoOperationResponse">
        <part name="respuestaPedido" element="ns:eltoRespuesta"/>
    </message>
    <message name="SolicitarPedidoOperationFault">
        <part name="excepcionPedido" element="ns:eltoExepcion"/>
    </message>
    <portType name="BpelIntegradoPortType">
        <operation name="SolicitarPedidoOperation">
            <input name="input1" message="tns:SolicitarPedidoOperationRequest"/>
            <output name="output1" message="tns:SolicitarPedidoOperationResponse"/>
            <fault name="fault1" message="tns:SolicitarPedidoOperationFault"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="BpelIntegrado">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="BpelIntegradoPortTypeRole" portType="tns:BpelIntegradoPortType"/>
    </plnk:partnerLinkType>
</definitions>
