Orchestration/Integrado_Bpel_Tienda_CA/test/SoloPedido/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpel="http://xml.netbeans.org/schema/BpelIntegrado">
  <soapenv:Body>
    <bpel:eltoSolicitud>
      <bpel:idCllte>1</bpel:idCllte>
      <!--1 or more repetitions:-->
      <bpel:lista_items>
        <bpel:idProd>1</bpel:idProd>
        <bpel:cantidad>1</bpel:cantidad>
      </bpel:lista_items>
    </bpel:eltoSolicitud>
  </soapenv:Body>
</soapenv:Envelope>