Orchestration/Integrado_Bpel_Tienda_CA/test/Pedido5Items/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpel="http://xml.netbeans.org/schema/BpelIntegrado">
  <soapenv:Body>
    <bpel:eltoSolicitud>
      <bpel:idCllte>1</bpel:idCllte>
      
      <bpel:lista_items>
        <bpel:idProd>1</bpel:idProd>
        <bpel:cantidad>1</bpel:cantidad>
      </bpel:lista_items>

      <bpel:lista_items>
        <bpel:idProd>2</bpel:idProd>
        <bpel:cantidad>1</bpel:cantidad>
      </bpel:lista_items>

      <bpel:lista_items>
        <bpel:idProd>3</bpel:idProd>
        <bpel:cantidad>1</bpel:cantidad>
      </bpel:lista_items>

      <bpel:lista_items>
        <bpel:idProd>4</bpel:idProd>
        <bpel:cantidad>1</bpel:cantidad>
      </bpel:lista_items>

      <bpel:lista_items>
        <bpel:idProd>5</bpel:idProd>
        <bpel:cantidad>1</bpel:cantidad>
      </bpel:lista_items>

    </bpel:eltoSolicitud>
  </soapenv:Body>
</soapenv:Envelope>